Repository: sgilra/language-translation
Catalog: src/main/resources/esen.tmx
Source language: es
Languages: en

source: "Profundizó"
en: "deepened"

source: "noche horrible"
en: "awful night"

source: "anfitrión"
en: "hosts"

source: "mantener los"
en: "hold"

source: "tercer partido"
en: "third-party"

source: "su incapacidad"
en: "failure"

source: "los encuentros"
en: "negotiations"

source: "valores periodísticos"
en: "journalistic values"

source: "organizaciones informativas"
en: "news organisations"

source: "NBD"
en: "NDB"

source: "archivos familiares personales"
en: "personal family archive"

source: "aspereza"
en: "roughness"

source: "mutismo"
en: "mutism"

source: "cantidad"
en: "sizes"

source: "juzgue a"
en: "prosecute"

source: "el MEDE"
en: "the ESM"

source: "portero de"
en: "goalkeeper in"

source: "soldados"
en: "personnel"

source: "consideren que"
en: "making sure"

source: "ídolo"
en: "mammon"

source: "pido humildemente"
en: "humbly ask"

source: "cerrados"
en: "shuttered"

source: "glosario"
en: "glossary"

source: "hermosa"
en: "beautiful"

source: "estatua"
en: "statue"

source: "madre"
en: "mother"

source: "padre"
en: "father"

source: "idioma"
en: "language"

source: "traducción"
en: "translation"

source: "máquina"
en: "machine"

source: "papel"
en: "paper"

source: "lápiz"
en: "pen"

source: "mucama"
en: "maid"

source: "ciudad"
en: "city"

source: "viaje"
en: "travel"

source: "hijo"
en: "son"

source: "sol"
en: "sun"

source: "ambiente"
en: "atmosphere"

source: "embrague"
en: "clutch"

source: "tratar"
en: "try"

source: "café"
en: "coffee"

source: "noche"
en: "evening"

source: "tres"
en: "three"

source: "cabello"
en: "hair"

source: "agosto"
en: "august"

source: "forzado"
en: "forced"

source: "oficina"
en: "office"

source: "degradar"
en: "demote"
